HotelReservation/test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Load Test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
	  <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Hotel Reservation" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <!-- <stringProp name="LoopController.loops">${__P(reqs-per-sec,10)}</stringProp> -->
		  <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(num-threads,10)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(ramp-time,1)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,60)}</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Search Hotel" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(hostname,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(port,5000)}</stringProp>
		  <stringProp name="HTTPSampler.path">/hotels?inDate=${__javaScript("2015-04-" + ("0" + (1 + Math.floor(Math.random() * 10))).slice(-2))}&amp;outDate=${__javaScript("2015-04-" + (11 + Math.floor(Math.random() * 10)))}&amp;lat=${__javaScript((38.0235 + (Math.random() * 0.481 - 0.2405)).toFixed(6))}&amp;lon=${__javaScript((-122.095 + (Math.random() * 0.325 - 0.157)).toFixed(6))}</stringProp>
		  <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Recommend" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(hostname,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(port,5000)}</stringProp>
          <stringProp name="HTTPSampler.path">/recommendations?require=rate&amp;lat=${__javaScript(38.0235 + (Math.random() * 0.481 - 0.2405))}&amp;lon=${__javaScript(-122.095 + (Math.random() * 0.325 - 0.157))}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="User Login" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(hostname,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(port,5000)}</stringProp>
          <stringProp name="HTTPSampler.path">/user?username=Cornell_${__Random(0,500)}&amp;password=${__Random(0,500)}${__Random(0,500)}${__Random(0,500)}${__Random(0,500)}${__Random(0,500)}${__Random(0,500)}${__Random(0,500)}${__Random(0,500)}${__Random(0,500)}${__Random(0,500)}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Reserve Hotel" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(hostname,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(port,5000)}</stringProp>
		  <stringProp name="HTTPSampler.path">/reservation?inDate=${__javaScript("2015-04-" + ("0" + (1 + Math.floor(Math.random() * 10))).slice(-2))}&amp;outDate=${__javaScript("2015-04-" + (11 + Math.floor(Math.random() * 10)))}&amp;lon=${__javaScript((-122.095 + (Math.random() * 0.325 - 0.157)).toFixed(6))}&amp;hotelId=${__Random(1,80)}&amp;customerName=Cornell_${__Random(0,500)}&amp;username=Cornell_${__Random(0,500)}&amp;password=${__Random(1000000000,9999999999)}&amp;number=1</stringProp>
		  <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>